Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyGridLines Property
 Curtain grid lines cannot be copied. If you are trying to copy the curtain wall, try using tab to select entire wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyGridLines { get; }
Public Shared ReadOnly Property CannotCopyGridLines As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyGridLines {
	FailureDefinitionId^ get ();
}
static member CannotCopyGridLines : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace